src/main/resources/schemas/TD_SCHEDULING_1_1_0_R/interactions/GetSubjectOfCareScheduleInteraction/GetSubjectOfCareScheduleInteraction_1.1_RIVTABP21.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Sveriges Kommuner och Landsting licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->		
<wsdl:definitions name='GetSubjectOfCareScheduleInteraction' xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' xmlns:xs='http://www.w3.org/2001/XMLSchema' xmlns:tjsr='urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1' xmlns:ih='urn:riv:interoperability:headers:1' xmlns:tns='urn:riv:crm:scheduling:GetSubjectOfCareSchedule:1:rivtabp21' targetNamespace='urn:riv:crm:scheduling:GetSubjectOfCareSchedule:1:rivtabp21' xmlns:itr='urn:riv:itintegration:registry:1'>
  <xs:annotation>
    <xs:documentation>
			 Tjänsteinteraktionens namn: GetSubjectOfCareScheduleInteraction
			 Beskrivning: 
			   Interaction to retrieve all timeslots scheduled for a subject of care at a healthcare facility.
			 Revisioner: 
			 Tjänstedomän: crm:scheduling
			 Tjänsteinteraktionstyp: Fråga-Svar
			 WS-profil: RIVTABP21
			 Förvaltas av: Sveriges Kommuner och Landsting
			 </xs:documentation>
  </xs:annotation>
  <wsdl:types>
    <xs:schema targetNamespace='urn:riv:crm:scheduling:GetSubjectOfCareSchedule:1:rivtabp21'>
      <xs:import schemaLocation='GetSubjectOfCareScheduleResponder_1.1.xsd' namespace='urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1' />
      <xs:import schemaLocation='../../core_components/itintegration_registry_1.0.xsd' namespace='urn:riv:itintegration:registry:1' />
      <xs:import schemaLocation='../../core_components/interoperability_headers_1.0.xsd' namespace='urn:riv:interoperability:headers:1' />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name='GetSubjectOfCareScheduleRequest'>
    <wsdl:part name='LogicalAddress' element='itr:LogicalAddress'>
      <wsdl:documentation>hsaid of the healthcare_facility owning the schedule</wsdl:documentation>
    </wsdl:part>
  <wsdl:part name='actor' element="ih:Actor" />
    <wsdl:part name='parameters' element='tjsr:GetSubjectOfCareSchedule' />
  </wsdl:message>
  <wsdl:message name='GetSubjectOfCareScheduleResponse'>
    <wsdl:part name='parameters' element='tjsr:GetSubjectOfCareScheduleResponse' />
  </wsdl:message>
  <wsdl:portType name='GetSubjectOfCareScheduleResponderInterface'>
    <wsdl:operation name='GetSubjectOfCareSchedule'>
      <wsdl:input message='tns:GetSubjectOfCareScheduleRequest' />
      <wsdl:output message='tns:GetSubjectOfCareScheduleResponse' />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name='GetSubjectOfCareScheduleResponderBinding' type='tns:GetSubjectOfCareScheduleResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='GetSubjectOfCareSchedule'>
      <soap:operation soapAction='urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1:GetSubjectOfCareSchedule' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:GetSubjectOfCareScheduleRequest' part='LogicalAddress' />
	    <soap:header use='literal' message='tns:GetSubjectOfCareScheduleRequest' part='actor' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name='GetSubjectOfCareScheduleResponderService'>
    <wsdl:port name='GetSubjectOfCareScheduleResponderPort' binding='tns:GetSubjectOfCareScheduleResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>