trunk/src/test/resources/testfiles/tidbokning/aggregated-tidbokningar-request.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<ns5:LogicalAddress 
			xmlns:ns5="urn:riv:itintegration:registry:1"
			xmlns:ns4="urn:riv:crm:scheduling:1.1" 
			xmlns:ns3="urn:riv:crm:scheduling:1"
			xmlns:ns2="urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1"
			xmlns="urn:riv:interoperability:headers:1">MEEE</ns5:LogicalAddress>
		<Actor xmlns:ns5="urn:riv:itintegration:registry:1" xmlns:ns4="urn:riv:crm:scheduling:1.1"
			xmlns:ns3="urn:riv:crm:scheduling:1"
			xmlns:ns2="urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1"
			xmlns="urn:riv:interoperability:headers:1">
			<actorId>194911172296</actorId>
			<actorType>subject_of_care</actorType>
		</Actor>
	</soap:Header>
	<soap:Body>
		<ns2:GetSubjectOfCareSchedule xmlns="urn:riv:interoperability:headers:1"
			xmlns:ns2="urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1"
			xmlns:ns3="urn:riv:crm:scheduling:1" xmlns:ns4="urn:riv:crm:scheduling:1.1"
			xmlns:ns5="urn:riv:itintegration:registry:1">
			<ns2:subject_of_care>194911172296</ns2:subject_of_care>
		</ns2:GetSubjectOfCareSchedule>
	</soap:Body>
</soap:Envelope>