vp-services/src/test/resources/testfiles/Rivta20RequestNoToData.xml

<?xml version='1.0' encoding='UTF-8'?>
<!--

    Copyright (c) 2013 Center for eHalsa i samverkan (CeHis).
    							<http://cehis.se/>

    This file is part of SKLTP.

    This library is free software; you can redistribute it and/or
    modify it under the terms of the GNU Lesser General Public
    License as published by the Free Software Foundation; either
    version 2.1 of the License, or (at your option) any later version.

    This library is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
    Lesser General Public License for more details.

    You should have received a copy of the GNU Lesser General Public
    License along with this library; if not, write to the Free Software
    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA

-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<ns5:To xmlns:ns5="http://www.w3.org/2005/08/addressing"
			xmlns:ns4="urn:riv:crm:scheduling:1.1" xmlns:ns3="urn:riv:crm:scheduling:1"
			xmlns:ns2="urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1"
			xmlns="urn:riv:interoperability:headers:1"></ns5:To>
	</soap:Header>
	<soap:Body>
		<ns2:GetSubjectOfCareSchedule xmlns="urn:riv:interoperability:headers:1"
			xmlns:ns2="urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1"
			xmlns:ns3="urn:riv:crm:scheduling:1" xmlns:ns4="urn:riv:crm:scheduling:1.1"
			xmlns:ns5="urn:riv:itintegration:registry:1">
			<ns2:healthcare_facility>SE2321000164-7381037590423
			</ns2:healthcare_facility>
			<ns2:subject_of_care>188803099368</ns2:subject_of_care>
		</ns2:GetSubjectOfCareSchedule>
	</soap:Body>
</soap:Envelope>