vp-services/src/test/resources/testfiles/GetSubjectOfCareRequest21.xml

<?xml version='1.0' encoding='UTF-8'?>
<!--

    Copyright (c) 2013 Center for eHalsa i samverkan (CeHis).
    							<http://cehis.se/>

    This file is part of SKLTP.

    This library is free software; you can redistribute it and/or
    modify it under the terms of the GNU Lesser General Public
    License as published by the Free Software Foundation; either
    version 2.1 of the License, or (at your option) any later version.

    This library is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
    Lesser General Public License for more details.

    You should have received a copy of the GNU Lesser General Public
    License along with this library; if not, write to the Free Software
    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA

-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:riv:interoperability:headers:1"
                  xmlns:urn1="urn:riv:itintegration:registry:1"
                  xmlns:urn2="urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1">
  <soapenv:Header>
    <urn:Actor>
      <urn:actorId>?</urn:actorId>
      <urn:actorType>?</urn:actorType>
    </urn:Actor>
    <urn1:LogicalAddress>demo-tidbok</urn1:LogicalAddress>
  </soapenv:Header>
  <soapenv:Body>
    <urn2:GetSubjectOfCareSchedule>
      <urn2:healthcare_facility>HSA-VKK123</urn2:healthcare_facility>
      <urn2:subject_of_care>188803099368</urn2:subject_of_care>
    </urn2:GetSubjectOfCareSchedule>
  </soapenv:Body>
</soapenv:Envelope>
